lib/stripe_mock/webhook_fixtures/payment_intent.canceled.json

{
  "id": "evt_00000000000000",
  "object": "event",
  "api_version": "2018-02-28",
  "created": 1578499109,
  "data": {
    "object": {
      "id": "pi_00000000000000",
      "object": "payment_intent",
      "amount": 900,
      "amount_capturable": 0,
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "canceled_at": 1578499109,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges?payment_intent=pi_00000000000000"
      },
      "client_secret": "pi_00000000000000",
      "confirmation_method": "automatic",
      "created": 1578499108,
      "currency": "eur",
      "customer": "cus_00000000000000",
      "description": null,
      "invoice": null,
      "last_payment_error": null,
      "livemode": false,
      "metadata": {},
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": "pm_00000000000000",
      "payment_method_options": {
        "card": {
          "installments": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card",
        "sepa_debit"
      ],
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "canceled",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_00000000000000",
    "idempotency_key": null
  },
  "type": "payment_intent.canceled"
}
