lib/stripe_mock/webhook_fixtures/payment_intent.payment_failed.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "payment_intent.payment_failed",
  "object": "event",
  "data": {
    "object": {
      "id": "pi_000000000000000000000000",
      "object": "payment_intent",
      "amount": 1099,
      "amount_capturable": 0,
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges?payment_intent=pi_000000000000000000000000"
      },
      "client_secret": null,
      "confirmation_method": "manual",
      "created": 1563276850,
      "currency": "usd",
      "customer": "cus_FRMUM4fCRoizOr",
      "description": null,
      "invoice": null,
      "last_payment_error": {
        "code": "payment_intent_authentication_failure",
        "doc_url": "https://stripe.com/docs/error-codes/payment-intent-authentication-failure",
        "message": "The provided PaymentMethod has failed authentication. You can provide payment_method_data or a new PaymentMethod to attempt to fulfill this PaymentIntent again.",
        "payment_method": {
          "id": "pm_000000000000000000000000",
          "object": "payment_method",
          "billing_details": {
            "address": {
              "city": null,
              "country": null,
              "line1": null,
              "line2": null,
              "postal_code": null,
              "state": null
            },
            "email": "admin@example.com",
            "name": null,
            "phone": null
          },
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "unchecked"
            },
            "country": "DE",
            "exp_month": 4,
            "exp_year": 2044,
            "fingerprint": "Buezs72zfZTodJze",
            "funding": "credit",
            "generated_from": null,
            "last4": "3184",
            "three_d_secure_usage": {
              "supported": true
            },
            "wallet": null
          },
          "created": 1563276846,
          "customer": null,
          "livemode": false,
          "metadata": {},
          "type": "card"
        },
        "type": "invalid_request_error"
      },
      "livemode": false,
      "metadata": {},
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "requires_source",
      "transfer_data": null,
      "transfer_group": null
    }
  }
}
